#텍스트 데이터 읽고 쓰기
#문제
#텍스트 데이터를 읽건 ㅏ써야하는데 서로 다른 인코딩을 사용해야 한다.
#텍스트 파일을 읽기위해 open함수에 rt모드를 사용한다
with open('somefile.txt','rt') as f: #파일 전체를 하나의 문자열로 읽음
    data = f.read()

with open('somefile.txt','rt') as f:
    for line in f:
        #라인처리

#마찬가지로 텍스트 파일을 쓰려면 wt 모드를 사용한다. 이 모드를 사용하면 모든 내용을 지우고 새로운 내용을 덮어쓴다.
with open('somefile.txt','wt') as f:
    f,write(text1)
    f.write(text2)

#파일 끝에 내용을 추가하려면 at모드
#토론
#텍스트 파일을 읽고 쓰는 과정은 그다지 어렵지 않다.
#하지만 몇가지 주의해야 할 점이 있다.
#우선 예제에서 사용한 with문이 파일을 사용할 콘텍스트를 만든다.
#컨트롤이 with블록을 떠나면 파일이 자동으로 닫힌다.
#유닉스와 윈도우는 줄바꿈 문자가 다르므로 주의한다.(\n , \r\n)
#파이썬은 보편적 줄바꿈 모드로 작동한다. 모든 줄바꿈 문자를 \n으로 벼노한한다.
#이런 자동 변환을 원하지 않으면
with open('file','rt',newline='') as f:
#읽으려는 파일 스펙을 잘 알아보고 인코딩을 올바르게 사용해야한다. 그래야 오류가 발생하지 않음.