##########################################################################################################
# 6.9] 16진수 인코딩, 디코딩
#   * 문자열로 된 16진수를 바이트 문자열로 디코딩하거나, 바이트 문자열을 16진법으로 인코딩해야 한다.
#       : 1) binascii 모듈 이용
#         2) base64 모듈 이용
#           base64의 encode와 decode는 대문자에만 동작하고, binascii는 대소문자를 가리지 않는다.
#           또한 인코딩 함수가 만들 출력물은 언제나 바이트 문자열이라는 점이 중요하다.
#           반드시 유니코드를 사용해야 한다면 디코딩 과정을 하나 더 추가해야 한다.
##########################################################################################################

# 최초 바이트 문자열
s = b'hello'

## binascii 모듈
# 16진법으로 인코딩
import binascii
h = binascii.b2a_hex(s)
print(h)    # b'68656c6c6f'

# 바이트로 디코딩
b = binascii.a2b_hex(h)
print(b)    # b'hello'

## base64 모듈
import base64
h = base64.b16encode(s)
print(h)    # b'68656C6C6F'
b = base64.b16decode(h)
print(b)    # b'hello'