##########################################################################################################
# 7.3] 함수 인자에 메타데이터 넣기
#   * 함수를 작성했다. 이때 인자에 정보를 추가해서 다른 사람이 함수를 어떻게 사용해야 하는지 알 수 있게 하고 싶다.
#       -> 함수 인자 주석 : 프로그래머에게 함수 사용법에 대한 정보를 줄 수 있다 !
#           함수 주석은 함수의 __annotation__ 속성에 저장된다.
#           주석을 활용할 방법은 많지만, 기본적으로는 문서화에 도움을 주기 위해 사용한다.
#           레시피 9.20에 주석을 활용한 고급 구현법 예제가 나온다.(함수 오버로드 등)
##########################################################################################################

def add(x:int, y:int) -> int:
    return x + y

help(add)   # add(x:int, y:int) -> int
print(add.__annotations__)  # {'x': <class 'int'>, 'y': <class 'int'>, 'return': <class 'int'>}