##########################################################################################################
# 7.4] 함수에서 여러 값을 반환
#   * 함수에서 값을 여러 개 반환하고 싶다.
#       : 튜플 사용
#           아래의 myfun()이 값을 여러개 반환하는 것처럼 보이지만, 사실은 튜플 하나를 반환한 것이다.
#           조금 이상해 보이지만, 실제로 튜플을 생성하는 것은 쉼표지 괄호가 아니다.
##########################################################################################################

def myfun():
    return 1, 2, 3

a, b, c = myfun()
print(a, b, c)  # 1 2 3

# 튜플을 생성하는 것은 쉼표지 괄호가 아니다 !
res = 1, 2, 3, 4, 5
print(res)  # (1, 2, 3, 4, 5)