##########################################################################################################
# 7.6] 이름 없는 함수와 인라인 함수 정의
#   * sort() 등에 사용할 짧은 콜백 함수를 만들어야 하는데, 한 줄짜리 함수를 만들면서 def 구문까지 사용하고 싶지는 않다.
#     그 대신 인라인(in line)이라 불리는 짧은 함수를 만들고 싶다.
#       : lambda
#           일반적으로 lambda는 정렬이나 데이터 줄이기 등 다른 작업에 사용할 때 많이 쓴다.
#           lambda를 사용해서 간단한 함수를 정의할 수 있지만, 제약이 아주 많다.
#           우선 표현식을 하나만 사용해야 하고, 그 결과가 반환 값이 된다.
#           따라서 명령문을 여러 개 쓴다거나 조건문, 순환문, 에러 처리 등을 넣을 수 있다.
#           파이썬 코드를 작성하면서 lambda를 사용하지 않아도 아무 상관이 없지만,
#           여러 표현식을 계산하는 작은 함수를 많이 쓰거나 콜백 함수를 사용하는 경우 종종 lambda를 발견하게 된다.
##########################################################################################################
add = lambda x, y: print(x + y)
add(2, 3)   # 5

add('hello', 'world') # 'helloworld'
