#이름없는 함수에서 변수고정
#문제
#람다를 사용해서 이름없는 함수를 정의했는데, 정의할 때 특저 변수의 값을 고정하고 싶다.
#해결
x = 10
a = lambda y:x+y
x=20
b=lambda y:x+y
a(10)
#람다에서 사용한 x값이 실행 시간에 달라지는 변수라는 점. 따라서 람다 표현식의 x 값은 그 함수를 실행할 때의 값이 됨.
#이름없느 ㄴ함수를 정의할 때 특정 값을 고정하고 싶으면 그 값을 기본값으로 지정하면됨
a = lambda y,x=x:x+y # 현재 있는 x에 람다안에있는 x를 대입하여 고정시킴

#토론
#이번 레시피에 나온 문제는 람다 함수를 조금 더 현명하게 사용할다가 발생하는 경우가 많다.
##예를 들어 리스트 컴프리헨션이나 반복문에서 람다 표현식을 생성하고 람다 함숙 ㅏ순환 변수를 기억하려고 할 때 발생하기 쉽다.
func = [lambda x : x+n for n in range(5)]
for f in func:
    print(f(0)) #같은값만 나옴

func = [lambda x, n=n: x+n for n in range(5)]
for f in func:
    print(f(0))
#이제 n  값을 함수를 정의하는 시점의 값으로 고정해 놓고 사용한다.