####################################################################################################
# 2.11] 문자열에서 문자 잘라내기
#   * 텍스트의 처음, 끝, 중간에서 원하지 않는 공백문 등을 잘라내고 싶다.
#
# 1] strip, lstrip, rstrip : 텍스트 좌우 잘라내기
#   1-1) strip() : 좌우 공백 전부 제거
#   1-2) strip('-') : 좌우의 '-'들을 전부 제거
#   1-3) strip('-=') : 좌우의 '-'와 '='를 전부 제거
#
# * 텍스트 가운데를 잘라내고 싶다면?
# 2] replace()
# 3] 정규 표현식
####################################################################################################

s = '   hello world \n'
print(s.strip())    # 'hello world'
print(s.lstrip())   # 'hello world \n'
print(s.rstrip())   # '   hello world'

t = '----hello===='
print(t.strip('-')) # 'hello===='
print(t.strip('-='))    # 'hello'