####################################################################################################
# 2.14] 문자열 합치기
#   * 작은 문자열 여러 개를 합쳐 하나의 긴 문자열을 만들고 싶다.
#
# 1] join()
#   : 합치고자 하는 문자열이 시퀀스나 순환 객체 안에 있을 때 가장 좋은 방법
# 2] +
#   : 합치고자 하는 문자열이 아주 적다면 이걸로도 가능.
#
#   * 주의 :
#       '+' 연산자로 많은 문자열을 합치려고 하면 메모리 복사와 가비지 컬렉션으로 인해 매우 비효율적이다 !
#       예시) s = ''
#            for p in parts:
#               s += p  # 새로운 객체를 만들어낸다 : 실행 속도가 느리다!
#
#   * print - sep
#       : print(a,b,c, sep=':') # a:b:c
####################################################################################################

parts = ['Is', 'Chicago', 'Not', 'Chicago?']

## 구분 문자열을 지정하여 문자열 모두 합치기 !
print(' '.join(parts))  # Is Chicago Not Chicago?
print(','.join(parts))  # Is,Chicago,Not,Chicago?
print(''.join(parts))   # IsChicagoNotChicago?

# 나쁜 방법
s = ''
for p in parts:
    s += p  # 새로운 객체를 만들어낸다 : 실행 속도가 느리다!

# 좋은 방법
''.join(p for p in parts)

