'''

☆ : 구현 1순위 기능
★ : 구현 2순위 기능 


####### 야구 다이나믹하게 #######


☆ 야구판 크게(틱택토 형식 or 파이게임)

☆ 득점 표시(전광판 업그레이드) : 반짝반짝하게 꾸미기, 1루~홈 표시

★ 특급타자 나오면 투수 마비(선수의 기록이 플레이에 영향) : 선수의 타율을 반영

☆ 업앤다운으로 위치맞추기

선수 육성(입실론)

응원가 틀면(또는 홈 어드벤티지) 타율상승

  

####### 야구 규칙 구체화 #######

☆ 병살타, 파울, 볼, 도루, 데드볼

투수교체



####### 게임 방식 #######

☆ 숫자 4개 대신 9칸 + 구질 추가 

숫자 4개 *로 놓고 input은 숫자 하나씩 하기 (컴퓨터가 출력할 숫자 4개를 *로 표시한 후 한개씩 밝혀지게)

★ 데이터 저장 및 불러오기(시즌제, 등수, 기록) : csv 파일로 누적 저장- 새로 시작하겠습니까? 이어서 하겠습니까?

★ 컴퓨터랑 하기



####### 해야할 것 #######

메인 하나(같이) + 서브(각자) + 함께 리뷰 

코드 알아오기(주석 달기, 월요일 실행 과정 랜덤으로 이어서 설명)
'''