####################################################################################################################
#5/31 업데이트내용  by 융

#5 * 5로 변경
#변화구, 직구, 던질 위치 입력 추가
#타격을 하지 않는 기능 추가
#타격을 하지 않는데 투수가 볼판정을 받는 위치에 공을 던지면 볼 카운트가 올라가는 기능 추가/포볼되면 진루하는 내용추가
#파울추가/2스트라이크에서 파울쳐도 스트라이크 숫자가 올라가지 않고 다시 하는 기능 추가
#안타 판정 추가 / 자세한건 코드에서..
#기록에서 볼넷일 경우 볼넷 갯수를 카운트해주는 기능 추가
#Original Source의 경우 컴퓨터가 생성하는 4개의 숫자가 중복이 되면 안되기 때문에 set으로 했지만 바꾼 게임 방식에서는 2개의 숫자가 중복이 될 수 있기 때문에 list로 변수형태 변경
#입력값에 대한 자잘한 validation추가
#자잘한 버그수정..
#볼넷기록, 홈런기록까지 전광판에 나오게 추가

#향후 고쳐야할 점
#버그리포트
#변수문제로 인해 기록이 저장되지 않음
#게임내용
#포볼 판정 되면 주자는 1루씩 진루하게 되지만 혼자 2루에 있을경우는 진루하지 말아야함. 현재는 주자가 있으면 무조건 진루함.           #
###############################################################################################################################
print('------------------------------절취선----------------------------------------------------------------------------')
##########################################################################################
#6/1 업데이트 by 융                                                                       #
#경기 종료후 결과판 수정(볼넷까지 나오게 수정)                                              #
#선수 기록 저장문제 해결                                                                   #
#볼넷되면 무조건 1루씩 이동하는 것 수정. (1루 비어있으면 1루만 채워지고 나머지 주자들은 정지) #
##########################################################################################
print('------------------------------절취선----------------------------------------------------------------------------')

#######################################################################################################################
#남은 과제 (should be done by 태흠)                                                                                    #
#도루, 병살타, 데드볼                                                                                                   #
#땅볼아웃 플라이아웃 추가??                                                                                             #
#######################################################################################################################

print('------------------------------절취선----------------------------------------------------------------------------')