    def save_record(self, save_path, *save_col):
        
        csvFile = open(save_path, 'a')        
        try :
            writer = csv.writer(csvFile)
            writer.writerow(save_col)
            
        finally:
            csvFile.close()        
        

    def load_record(self, load_path):
        record = [record for record in csv.reader(open(load_path, 'r')) if len(record) !=0 ]
        print(record)
        return record
        
    
    
'''
[['삼성', '박해민', '1.0', '1', '1', '0', '0'], 
['한화', '정근우', '1.0', '1', '1', '0', '0'], 
['삼성', '강한울', '1.0', '1', '1', '0', '0'], ['한화', '이용규', '0.0', '1', '0', '0', '0'], ['삼성', '구자욱', '0.0', '1', '0', '0', '0'], ['한화', '송광민', '0.0', '1', '0', '0', '0'], ['삼성', '이승엽', '1.0', '1', '1', '1', '0'], ['한화', '최진행', '1.0', '1', '1', '1', '0'], ['삼성', '이원석', '0.0', '1', '0', '0', '0'], ['한화', '하주석', '1.0', '1', '1', '0', '0'], ['삼성', '조동찬', '0.0', '1', '0', '0', '0'], ['한화', '장민석', '1.0', '1', '1', '1', '0'], ['삼성', '김헌곤', '0.0', '0', '0', '0', '0'], ['한화', '로사리오', '1.0', '1', '1', '0', '0'], ['삼성', '이지영', '0.0', '0', '0', '0', '0'], ['한화', '이양기', '1.0', '1', '1', '0', '0'], ['삼성', '김정혁', '0.0', '0', '0', '0', '0'], ['한화', '최재훈', '0.0', '1', '0', '0', '0']]
'''