#이터레이터의 일부 얻기
#문제 이터레이터가 만드는 데이터의 일부를 얻고 싶지만, 일반적인 자르기 연산자가 도작하지 않는다.
#해결 이터레이터와 제너레이터의 일부를 얻는 데는 다음처럼.
def count(n):
    while True:
        yield n
        n+=1

c=count(0)
c[10:20]

import itertools
for x in itertools.islice(c,10,20):
    print(x)

#이터레이터와 제너레이터는 일반적으로 일부를 잘라날 수 없다. 왜냐하면 데이터의 길이를 알 수 없기 때문이다.(인덱스를 구현하지도 않음)
#islice()의 실행 결과는 원하는 아이템의 조각을 생성하는 이터레이터이지만, 이는 시작 인덱스까지 모든 아이템을 소비하고 버리는 식으로 수행한다.
#그리고 그 뒤의 아이템은 마지막 인덱스를 만ㄴ날 때 까지 islice()객체가 생성한다.
#주어진 이터레이터 상에서 islice()가 데이터를 소비한다는 점이 중요하다. 이터레이터를 뒤로 감을 수는 없기 때문에 이 부분을 잘 고려해야 한다.
#뒤로 돌아가는 동작이 중요하다면 데이터를 먼저 리스트로 변환하는 것이 좋다.
