##########################################################################################################
# 4.12] 서로 다른 컨테이너 아이템 순환
#   * 여러 객체에 동일한 작업을 수행해야 하지만, 객체가 서로 다른 컨테이너에 들어있다.
#     하지만 동일한 반복문을 여러번 사용해 코드의 가독성을 해치고 싶지 않다.
#
# 1] itertools.chain()
#   : 일반적으로 모든 아이템에 동일한 작업을 수행하고 싶지만, 이 아이템이 서로 다른 세트에 포함되어 있을 때 사용
# 2] +
#   : chain이 메모리 면에서나 범용성 면에서나 좋다. chain 쓰자.
##########################################################################################################
from itertools import chain
a = [1, 2, 3, 4]
b = ['x', 'y', 'z']
for x in chain(a, b):
    print(x, end=' ')   # 1 2 3 4 x y z

