##########################################################################################################
# 4.16] 무한 while 순환문을 이터레이터로 치환
#   * 함수나 일반적이지 않은 조건 테스트로 인해 무한 while 순환문으로 데이터에 접근하는 코드를 만들었다.
##########################################################################################################

## 입출력과 관련된 프로그램에 일반적으로 사용하는 코드
CHUNKSIZE = 8192

def reader(s):
    while True:
        data = s.recv(CHUNKSIZE)
        if data == b'':
            break
        #작업...

# 이렇게 수정할 수 있다 !
def reader(s):
    for chunk in iter(lambda: s.recv(CHUNKSIZE), b''):
        pass
        #작업...

