##########################################################################################################
# 4.15] 정렬된 여러 시퀀스를 병합 후 순환
#   * 정렬된 시퀀스가 여럿 있고, 이들을 하나로 합친 후 정렬된 시퀀스를 순환하고 싶다.
#
# 1] heapq.merge()
#   : 정렬된 시퀀스들을 넣으면 정렬된 순서로 반환해준다.
#     단순히 앞부분을 비교해서 더 작은 값을 순차적으로 내뱉을 뿐이므로, 들어가는 시퀀스는 모두 정렬되어 있어야 한다.
##########################################################################################################
import heapq

a = [1, 4, 7, 10]
b = [2, 5, 6, 11]
for c in heapq.merge(a, b):
    print(c, end=' ')   # 1 2 4 5 6 7 10 11