##########################################################################################################
# 4.7] 이터레이터의 일부 얻기
#   * 이터레이터가 만드는 데이터의 일부를 얻고 싶지만, 일반적인 자르기 연산자가 동작하지 않는다.
#
# * itertools.islice() 사용
#   : 일반적으로 이터레이터와 제너레이터는 전체 길이를 알 수 없기 때문에, 일부를 잘라낼 수도 없다.
#     islice는 원하는 인덱스 위치까지의 아이템을 소비하는 방식으로 자르기를 수행한다.
#     따라서 islice로 소모한 이터레이터를 되감는 것이 불가능하므로, 그러한 작업이 필요하다면
#       데이터를 리스트로 변환해서 사용하는 것이 좋다.
##########################################################################################################
import itertools

def count(n):
    while True:
        yield n
        n += 1

c = count(0)
# c[10:20] # TypeError: 'generator' object is not subscriptable

## islice()를 이용한 해결
for x in itertools.islice(c, 10, 20):
    print(x, end=' ')   # 10 11 12 13 14 15 16 17 18 19

## 한번 소모한 이터레이터는 되돌아오지 않는다
for x in itertools.islice(c, 10, 20):
    print(x, end=' ')   # 30 31 32 33 34 35 36 37 38 39 