##########################################################################################################
# 4.3] 제너레이터로 새로운 순환 패턴 생성
#   * 내장 함수(range(), reversed())와는 다른 동작을 하는 순환 패턴을 만들고 싶다.
#
# 1] 제너레이터 사용
#   : 이런 함수를 사용하려면, for 순환문이나 순환 객체를 소비하는 다른 함수(sum, list 등)를 사용한 순환을 해야 한다.
##########################################################################################################

def frange(start, stop, increment):
    x = start
    while x < stop:
        yield x
        x += increment


for n in frange(0, 1, 0.125):
    print(n, end=' ')   # 0 0.125 0.25 0.375 0.5 0.625 0.75 0.875

