##########################################################################################################
# 4.5] 역방향 순환
#   * 시퀀스 아이템을 역방향으로 순환하고 싶다.
#
# 1] reversed()
#   : 객체가 __reversed__() 특별 메소드를 구현하고 있거나 크기를 알 수 있을 때 사용 가능
#     둘 다 만족하지 못하면, 우선 객체를 리스트로 변환해야만 한다.
#     객체->리스트는 메모리 소모가 크므로, 가능하면 __reversed__()를 구현하자.
##########################################################################################################

a = [1, 2, 3, 4]
for x in reversed(a):
    print(x, end=' ')   # 4 3 2 1

