##########################################################################################################
# 5.3] 구별자나 종단 부호 바꾸기
#   * print()를 사용해 데이터를 출력할 때 구분자나 종단 부호(line ending)를 바꾸고 싶다.
#
# 1] print()에 sep과 end 키워드 인자 사용
# 2] join() 사용
#   * 문자열에만 동작한다는 문제점이 있다. 또한 sep 키워드가 훨씬 간단하다.
##########################################################################################################

print('ACME', 50, 91.5)                         # ACME 50 91.5
print('ACME', 50, 91.5, sep=',')                # ACME,50,91.5
print('ACME', 50, 91.5, sep=',', end='!!\n')   # ACME,50,91.5!!