##########################################################################################################
# 5.6] 문자열에 입출력 작업하기
#   * 파일같은 객체에 동작하도록 작성한 코드에 텍스트나 바이너리 문자열을 제공하고 싶다.
#
# * 아래 클래스들로 일반 파일 기능을 흉내낼 수 있다.(유닛 테스트 등에 유용)\
#   file, pipe, socket 등 실제 시스템 레벨 파일을 요구하는 코드에는 사용할 수 없다.
# 1] io.StringIO()
#   : 텍스트에 사용
# 2] io.BytesIO()
#   : 바이너리 데이터에 사용
##########################################################################################################
import io

s = io.StringIO()
s.write('Hello World\n')
print('This is a test', file=s)

# 기록한 모든 데이터 얻기
s.getvalue()    # 'Hello World\nThis is a test\n'

s = io.StringIO('Hello\nWorld\n')
print(s.read(4))    # Hell
print(s.read()) # o\nWorld\n

