##########################################################################################################
# 5.8] 고정 크기 레코드 순환
#   * 파일을 줄 단위로 순환하지 않고, 크기를 지정하여 그 단위별로 순환하고 싶다.
#       : iter(), functools.partial() 사용
##########################################################################################################
from functools import partial

RECORD_SIZE = 32

# 고정 크기 레코드를 읽기 위해서는 이와 같이 파일을 바이너리 모드로 여는 것이 일반적이다.
# 여기서 records는 파일의 마지막에 도달할 때까지 고정 크기 데이터를 생산하는 순환 객체이다.
with open('s.data', 'rb') as f:
    records = iter(partial(f.read, RECORD_SIZE), b'') # 파일을 읽었지만 마지막에 도달했다면 종료값인 b''를 반환한다.
    for r in records:
        pass
        #작업

