##########################################################################################################
# 5.15] 망가진 파일 이름 출력
#   * 프로그램에서 디렉터리 리스트를 받아 파일명을 출력하려 할 때,
#     UnicodeEncodeError 예외와 "surrogates not allowed" 메세지가 발생하면서 프로그램이 죽어버린다.
#       : 출처를 알 수 없는 파일명을 출력할 때, 아래의 코드로 에러를 방지한다.
#         세상에는 우리가 예측하지 못하는 동작을 하는 사용자가 어디에나 있으니 조심해야 한다.
#         상세한 내용은 쿡북 5.15 참조.
##########################################################################################################

# 파일명 에러 방지
def bad_filename(filename):
    return repr(filename)[1:-1]

filename="blah blah"
try:
    print(filename)
except UnicodeEncodeError:
    print(bad_filename(filename))