##########################################################################################################
# 5.19] 임시 파일과 디렉터리 만들기
#   * 임시 파일이나 디렉터리를 만들어 프로그램에 사용해야 한다. 그 후에 파일이나 디렉터리는 아마도 파기할 생각이다.
#
# 1] tempfile 모듈 사용
#   1] TemporaryFile()
#        : 이름 없는 임시 파일 생성
#   2] NamedTemporaryFile()
#       : 이름 있는 임시 파일 생성
#   3] TemporaryDirectory()
#       : 임시 디렉터리 생성
#   4] gettempdir()
#       : 임시 파일의 실제 위치를 찾는 함수
##########################################################################################################

from tempfile import TemporaryFile

# 임시 파일 생성
with TemporaryFile('w+t') as f:
    # 파일에서 읽기 쓰기
    f.write('Hello World\n')
    f.write('Testing\n')

    # 처음으로 이동해 데이터를 읽는다.
    f.seek(0)
    data = f.read()

    #종료 후 임시 파일은 폐기된다.
