##########################################################################################################
# 5.18] 기존 파일 디스크립터를 파일 객체로 감싸기
#   * 운영체제 상에 이미 열려있는 I/O 채널에 일치하는 정수형 파일 디스크립터를 가지고 있고,
#     이를 상위 레벨 파이썬 파일 객체로 감싸고 싶다.
#       : UNIX 시스템에서 pipe, socket 등의 I/O 채널을 파일과 같은 인터페이스로 사용할 수 있다 !
##########################################################################################################
# 하위 레벨 파일 디스크립터 열기
import os
fd = os.open('s.txt', os.O_WRONLY | os.O_CREAT)

# 올바른 파일로 바꾸기
f = open(fd, 'wt')
f.write('hello world\n')
f.close()

# 파일 객체를 생성하지만, 사용이 끝났을 때 fd를 닫지 않는다.
f = open(fd, 'wt', closefd=False)

