#파일이름 인코딩 우회
#문제
#시스템의 기본 인코딩으로 디코딩 혹은 인코딩 되지 않은 파일 이름에 입출력 작업을 수행 해야 한다.
#해결
#기본적으로 모든 파일 이름은 sys.fetfilesystemencoding()이 반환하는 텍스트 인코딩 값으로 디코딩 혹은 인코딩 되어 있다.
sys.getfilesystemencoding()
#하지만 이 인코딩을 우회하길 바란다면 raw바이트 문장ㄹ로 파일 이름을 명시해야 한다.
#유니코드로 파일 이름을 쓴다.
with open('jalape\xflo.txt','w') as f:
    f.write('Spicy!')

#디렉터리 리스트(디코딩 됨)
import os
os.listdir('.')

#로우 파일 이름으로 파일 열기
with open(b'jalpen\xcc\x83o.txt') as f:
    print(f.read())

#마지막 두 작업에서 나온 것 처럼 open()이나 os.listdir()와 같은 파일 관련 함수에 바이트 문자열을 넣었을 때 파일 이름 처리는 거의 변하지 않는다.
#토론
#일반적인 환경에서 파일 이름 인코딩, 디코딩에 대해 걱정할 필요는 없다.
#인코딩 규칙을 따르지 않는 파일이름은 파일 파일이름은 많은 파일을 다루는 파이썬 프로그램을 망가트릴 수 있다.
#파일 이름과 디렉터리를 읽을 때 디코딩되지 않은 로우 바이트를 이름으로 사용하면 프로그래밍 과정은 조금 귀찮겠지만 이런 문제점을 피할 수 있다.
