####################################################################################################
# 3.1] 반올림
#   * 부동 소수점 값을 10진수로 반올림하고 싶다.
#
# 1] round(value, ndigits)
#
#  * 주의사항 : 단순히 자릿수를 자르고 싶은 거라면 반올림을 하지 말고 자릿수를 명시해라 !
#   ex) format(x, '0.2f')
####################################################################################################
a = round(1.23, 1)
print(a)    # 1.2
b = round(-1.27, 1)
print(b)    # -1.3
c = round(1.25361, 3)
print(c)    # 1.254
d = round(1877650, -3)
print(d)    # 1878000

print(round(1.5))   # 2
print(round(2.5))   # 2 : 정확히 가운데인 경우 가장 가까운 짝수를 선택한다!
print(round(3.5))   # 4