####################################################################################################
# 3.3] 출력을 위한 숫자 서식화
#   * 출력을 위해 자릿수, 정렬, 천 단위 구분 등 문자를 서식화하고 싶다.
#
# 1] format() 사용
#   : 출력을 위한 숫자 서식화
#     일반적인 형식 : '[<>^]?너비[,]?(.자릿수)?'
#       => 너비와 자릿수는 정수형, ?는 선택사항임을 표시
# 2] ~.format()
#   : 동일한 형식 사용
#
# 3] 구분자 변경
####################################################################################################
x = 1234.56789

## 소수점 표현
print(format(x, '0.2f'))    # '1234.57' : 소수점 둘째 자리까지 표현
print(format(x, '<10.1f'))  # '1234.6    '  # 소수점 첫째 자리까지 표현하고 10개 기준 오른쪽 정렬

## 천 단위 구분자 넣기
print(format(x, '0,.1f'))   # '1,234.6'

## 지수 표현법 사용
print(format(x, 'e'))       # '1.234568e+03'
print(format(x, '0.2E'))    # 1.23E+03 : 소수점 아래 두번째 자리까지 표시한 지수 표현법

## ~.format()
print('The value is {:0,.2f}'.format(x))    # The value is 1,234.57

## 구분자 변경
swap_sep = {ord('.'): '점', ord(','): '쉼'}
print(format(x, ',').translate(swap_sep))   # 1쉼234점56789
