####################################################################################################
# 3.4] 2진수, 8진수, 16진수 작업
#   * 숫자를 2, 8, 16진수로 출력해야 한다.
#
# 1] bin(), oct(), hex() 사용
#   : 앞에 0b, 0o, 0x가 붙는다.
# 2] format() 사용
#   : 안 붙는다.
# 3] int()
#   : 다른 진법의 문자를 10진수로 변환
####################################################################################################
x = 1234

## bin, oct, hex 사용
print(bin(x))   # 0b10011010010
print(oct(x))   # 0o2322
print(hex(x))   # 0x4d2

## format() 사용
print(format(x, 'b'))   # 10011010010
print(format(x, 'o'))   # 2322
print(format(x, 'x'))   # 4d2

# 32비트 값 표현
x = -1234
print(format(2**32 + x, 'b'))   # 11111111111111111111101100101110

# int() : 다른 진법의 숫자를 정수형으로 변환
print(int('4d2',16)) # 1234