####################################################################################################
# 3.2] 정확한 10진수 계산
#   * 정확한 10진수 계산을 해야 하고, 부동 소수점을 사용할 때 발생하는 작은 오류를 피하고 싶다.
#
# 1] decimal 모듈 사용
#   : 정확한 계산이 가능하지만, 성능 측면에서의 손해를 감수해야 한다.
#     주로 금융 데이터를 다룰 때 많이 사용한다.
####################################################################################################

## 문제점 : 10진수를 아주 정확히 표현하지 못한다.
a = 4.2
b = 2.1
print(a + b)    # 6.300000000000001
print(a+b == 6.3) # False

## decimal 모듈 사용
from decimal import Decimal
a = Decimal('4.2')
b = Decimal('2.1')
c = a + b
print(c)  # 6.3
print((a+b) == Decimal('6.3')) # True
